import { Row } from "@/src/types/interfaces";

const strory1: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "كيف تحوّلت العلامة الوطنية لإدارة فروعها بفعالية أكبر",
      text: "علامة تجارية معروفة في مجال بيع العصائر بالتجزئة في منطقة الخليج، تمتلك أكثر من 45 فرعًا وتخدم عملاءها منذ عام 1978. منذ بداياتها، نمت لتصبح رمزًا وطنيًا، تقدم خدمات التجزئة، التموين، والتوصيل. لكن إدارة العمليات بسلاسة عبر الفروع باستخدام انظمة قديمة ومعقدة أصبحت مكلفة وغير فعّالة.",
    },
  },
  {
    type: "normalRow",
    props: {
      title: "التحديات التي واجهتها عصير الضاحية قبل الشراكة مع أمـركـ",
      text: "قبل الشراكة مع أمرك، كانت عصير الضاحية تستخدم نظامًا معقد ومكلف. بجانب التكاليف التشغيلية العالية (Opex) و تحديات في خدمة العملاء والدعم الفني، كانت تشكل عبئًا على الشركة. بالإضافة إلى ذلك، كانت متطلبات الامتثال لمعايير المرحلة الثانية ZATCA تزيد من تعقيد العمليات. كانت عصير الضاحية بحاجة إلى نظام يقلل التكاليف، يحسن التحكم في المخزون، ويقدم خدمات أفضل لما بعد البيع",
    },
  },
  {
    type: "normalRow",
    props: {
      title: "لماذا أمـركـ؟",
      text: "اختارت عصير الضاحية أمريك بسبب توافرها الدائم والدعم المتواصل. قدمت أمـركـ نموذج SaaS للحلول البرمجية مما جعلها الحل الأمثل لتبسيط العمليات التشغيلية.",
    },
  },
  {
    type: "rowDottedWithIntro",
    props: {
      title: "رحلة التحول والنتائج",
      quoteBefore:
        "تمكنت أمـركـ من تحقيق نجاح ملموس لعصير الضاحية في فترة قصيرة دون أي تعطيل للعمليات.",
      introText: "منذ اعتماد أمريك، حققت عصير الضاحية النتائج التالية:",
      content: [
        "تقليل التكاليف التشغيلية بنسبة 5%",
        "تسريع إجراءات البيع وتحسين أداء المخزون",
        "تقديم برنامج ولاء وخدمات متطورة",
      ],
      quoteAfter:
        "مع دعم أمريك المستمر، تواصل عصير الضاحية توسعها وزيادة كفاءة فروعها الجديدة في جميع أنحاء المنطقة.",
    },
  },
];

export default strory1;

export const quote = {
    qoute: "أمرك قامت بتحويل عملياتنا، حيث خفضت تكاليفنا بنسبة 80٪ وساعدتنا على التوسع بشكل أسرع من أي وقت مضى. دعمهم المباشر ومنصتهم الموفرة للتكلفة جعلتهم شريكًا لا يقدر بثمن في رحلتنا.", 
    person:"مدير التحول التكنولوجي، عصير الضاحية"
}
