import { Row } from "@/src/types/interfaces";

const strory10: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "كيف حافظ نونه على سرعة الخدمة رغم الطلب المرتفع؟",
      text: "واجه متجر نونه آيسكريم، وهو متجر شعبي للآيس كريم السريع، تحديًا في مواكبة الطلب المرتفع من العملاء خلال ساعات الذروة، مع الحفاظ على سرعة وكفاءة الخدمة. حيث أثرت الطوابير الطويلة وبطء معالجة الطلبات على رضا العملاء وحدت من قدرتهم على خدمة المزيد من الضيوف في أوقات الذروة.",
    },
  },
  {
    type: "normalRow",
    props: {
      title: "أمـركـ يُمكن نونه آيسكريم من مواكبة الطلب المرتفع",
      text: "قامت أمرك بتوفير نظام كاشير بواجهة سهلة الاستخدام، مما مكن فريق نونه من معالجة الطلبات بشكل أسرع وإدارة طلبات أوقات الذروة بفاعلية أكبر. ساهمت الواجهة سهلة الاستخدام في تقليل وقت التدريب وساعدت الموظفين على استقبال وإتمام الطلبات بكل سلاسة.",
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "خدمة أسرع و رضا أكبر للعملاء مع أمـركـ",
      content: [
        {
          text: "تسريع معالجة الطلبات:",
          highlight: false,
          description: "بفضل نظام الكاشير من أمرك، تمكن فريق نونه آيسكريم من تسريع عملية استقبال الطلبات، مما أتاح للفريق خدمة عدد أكبر من العملاء في وقت أقل وتقليل أوقات الانتظار.",
        },
        {
          text: "تحسين رضا العملاء:",
          highlight: false,
          description: "أسهمت الخدمة السريعة والكفؤة في إبقاء العملاء راضين، مما أدى إلى تجربة أكثر سلاسة وراحة لكل ضيف.",
        },
      ],
      quoteAfter: "بفضل نظام الكاشير من أمرك، تمكنت نونه آيسكريم من تحسين سرعة الخدمة وتنظيم تدفق العملاء بفعالية، مما ساعدهم على تلبية الطلب بكفاءة. والنتيجة هي تجربة أسرع وأكثر سلاسة لعملائهم، مما ساعد نونه في تقديم تجربة منعشة تجذب الزبائن للعودة مرة أخرى."
    },
  },
 
];

export default strory10;
