import { Row } from "@/src/types/interfaces";

const strory2: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "تحسين العمليات وزيادة الإيرادات في مطابيق",
      text: "مطابيق، مطعم شهير لتقديم المطبق في شمال الرياض، معروف بمذاق معجناته اللذيذة على الصاج وخدمة طلبات الأون لاين السريعة. مع نمو قاعدة العملاء وتزايد التنافس المحلي، كانت مطابيق بحاجة إلى حل حديث لتحسين عملياتها وزيادة مبيعات طلبات الأون لاين. تعرّف على كيفية مساهمة نظام نقاط البيع وطلبات طلبات الأون لاين من أمرك في زيادة الإيرادات وتبسيط العمليات وتحسين تجربة العملاء.",
    },
  },
  {
    type: "normalRow",
    props: {
      title: "نبذة عن مطابيق ورحلة نجاحها في تقديم تجربة فريدة",
      text: "تأسست مطابيق في عام 2023 وسرعان ما أصبحت من ضمن المطاعم المفضلة لدى المجتمع المحلي بفضل استخدامها لمكونات عالية الجودة وتقديم خدمة فعالة. ولكن مع تزايد الطلب على سرعة استلام الطلبات وطلبات الأون لاين، والحاجة إلى تحسين العمليات، أدركت مطابيق أن تبني التكنولوجيا كان ضروريًا للحفاظ على القدرة التنافسية في السوق.",
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "التحديات التي واجهت مطابيق في تحسين تجربة العملاء",
      quoteBefore:
        "كمطعم جديد ومتنامٍ، توقعت مطابيق حدوث بعض التحديات التي قد تعرقل عملياتها ورضا العملاء، وتشمل:",
      content: [
        {
          text: "أوقات انتظار طويلة:",
          highlight: true,
          description: "مع تزايد شعبية المطعم، أرادت مطابيق التأكد من عدم مواجهة العملاء لأوقات انتظار طويلة عند استلام الطلبات ، خاصة خلال أوقات الذروة.",
        },
        {
          text: "انظمة طلبات الأون لاين غير الفعّالة:",
          highlight: true,
          description: "لتجنب الأخطاء أو الطلبات الفائتة مع زيادة الطلب، بحثت مطابيق عن نظام طلبات أون لاين سلس يبسط العملية للعملاء والموظفين.",
        },
        {
          text: "بيانات عملاء محدودة:",
          highlight: true,
          description: "مع إدراك قيمة اتخاذ القرارات المستندة على البيانات، أرادت مطابيق الحصول على رؤى حول سلوك العملاء لتحسين قائمة الطعام وتطوير جودة الخدمة.",
        },
      ],
      quoteAfter: "هذه التحديات قد تؤدي إلى أوقات انتظار أطول، وانخفاض رضا العملاء، وفقدان فرص لزيادة الإيرادات.",
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "الحلول الفعّالة لتحسين العمليات وزيادة المبيعات",
      quoteBefore: "قدمت أمرك نظام نقاط بيع ونظام طلبات أون لاين متكامل يلبي احتياجات مطابيق الفريدة.",
      content: [
        {
            text: "تنفيذ نظام نقاط البيع:",
            highlight: true,
            description: "قام فريق أمرك بتفعيل نظام نقاط بيع حديث يسهّل معالجة الطلبات، يقلل الأخطاء، ويحسن كفاءة العمليات."

        },
        {
            text: "تكامل الطلبات الإلكترونية:",
            highlight: true,
            description: " تم دمج منصة طلبات الأون لاين سهل الاستخدام مدمج مع نظام نقاط البيع، مما أتاح للعملاء تقديم طلباتهم مباشرة عبر قائمة مطابيق الإلكترونية."

        },
        {
            text: "التدريب والدعم:",
            highlight: true,
            description: "قدمت أمرك تدريبًا مكثفًا ودعمًا مستمرًا لضمان انتقال سلس وزيادة استفادة فريق عمل مطابيق من النظام."

        },
      ],
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "نتائج تنفيذ النظام وتأثيراته الإيجابية",
      content: [
        {
            text: "تحسين كفاءة عمليات مطابيق:",
            highlight: true,
            description: "أدى نظام نقاط البيع المبسط إلى تسريع معالجة الطلبات، مما أدى إلى خدمة أسرع ورضا أكبر للعملاء."

        },
        {
            text: "زيادة في طلبات الأون لاين:",
            highlight: true,
            description: "تشكل الطلبات الاستلام عبر مطابيق أون لاين حوالي 6% من إجمالي المبيعات، مما يعكس تزايد تفضيل العملاء للحلول الرقمية."

        },
      ],
      quoteAfter: "نجح نظام نقاط البيع والطلبات أون لاين من أمرك في تلبية احتياجات مطابيق التشغيلية، مما أدى إلى تحسين في الكفاءة ورضا العملاء. تخطط مطابيق لمواصلة الاستفادة من تقنية أمرك لتعزيز تجربة العملاء وتوسيع قاعدة العملاء في السوق.",
    },
  }
];

export default strory2;

export const quote = {
  qoute: "طوّر نظام أمرك طريقة عملنا بالكامل. عملاؤنا يحبون سهولة الطلب أون لاين، وفريق العمل يعتمد على نظام نقاط البيع سهل الاستخدام.",
  person: "— أ. عبدالمحسن البريدي، الشريك المؤسس لمطابيق",
};
