import { Row } from "@/src/types/interfaces";

const strory4: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "من التحدي إلى الحل: قصة إدارة النمو السريع",
      text: "تسببت شهرة النقطة الساخنة في تحديات عدة، لا سيما في إدارة العدد الكبير من العملاء خلال ساعات الذروة. كانت الطوابير الطويلة وأوقات الانتظار تؤثر على رضا العملاء، مما جعل من الصعب الحفاظ على تجربة سريعة وفعالة تلبي توقعات العملاء.",
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "الحلول التقنية المبتكرة من أمـركـ",
      content: [
        {
          text: "نظام نقاط البيع الذكي:",
          highlight: true,
          description: "قدّمت أمرك واجهة كاشير سهلة الاستخدام، مكّنت فريق النقطة الساخنة من تلقي الطلبات بسلاسة وتقليل وقت الانتظار لكل عميل. كما تمت إضافة نظام نقاط البيع المتنقل، مما منح فريق النقطة الساخنة ميزة التنقل والمرونة.",
        },
        {
          text: "تقارير وتحليلات لحظية:",
          highlight: true,
          description: "بفضل أدوات التقارير المتقدمة من أمرك، حصلت النقطة الساخنة على بيانات قيمة حول فترات الذروة وأنماط الطلبات. ساعدت هذه البيانات فريق الإدارة في تحسين توزيع الموظفين والاستعداد بشكل أفضل لساعات الازدحام",
        },
      ],
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "تفوق عملي ونجاح يتحدث عن نفسه",
      content: [
        {
          text: "تسريع معالجة الطلبات:",
          highlight: false,
          description: "بفضل تقنية أمرك، استطاعت النقطة الساخنة تسريع عملية أخذ الطلبات، مما أدى إلى تقليل أوقات الانتظار وتقليل الطوابير.",
        },
        {
          text: "تحسين تجربة العملاء:",
          highlight: false,
          description: "ساهمت الخدمة السريعة في رفع مستوى رضا العملاء.",
        },
        {
          text: "اتخاذ قرارات مدروسة:",
          highlight: false,
          description: "ساعدت التحليلات اللحظية على فهم انماط تدفق العمليات بشكل أفضل والاستجابة لها، مما أتاح للنقطة الساخنة اعتماد نهج أكثر كفاءة وتركيزًا على رضا العملاء",
        },
      ],
      quoteAfter: "من خلال حلول أمرك، تمكنت النقطة الساخنة من تحسين تجربة الخدمة، وتلبية التوقعات العالية للعملاء مع تبسيط العمليات التشغيلية. وقد ساعدت أدوات أمرك النقطة الساخنة على إدارة الطلبات العالية بكفاءة، مما أسفر عن خدمة أسرع وتجربة أكثر سلاسة للعملاء.",
    },
  },
];

export default strory4;

