import { Row } from "@/src/types/interfaces";

const strory5: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "كيف واجه مطعم ميجانا أزمة نقص العمالة في كندا؟",
      text: "واجه مطعم ميجانا، المطعم المتوسطي المحبوب في بيرلينجتون بكندا، تحديًا شائعًا بين العديد من المطاعم في كندا: تكاليف التوظيف المرتفعة. ومع قلة عدد الموظفين المتاحين، كان هناك بطء في الخدمة أثر على رضا العملاء. بحثًا عن حل يساعد في تحسين العمليات دون التضحية بجودة الخدمة، لجأ مطعم ميجانا إلى أمرك.",
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "حلول أمـركـ تُعزز رضا العملاء في مطعم ميجانا",
      quoteBefore : "قامت أمرك بتطبيق حلول مبتكرة شملت ما يلي:",
      content: [
        {
          text: "خدمة الطلب والدفع عبر QR مباشرة على الطاولات،",
          highlight: false,
          description: "مما أتاح لعملاء مطعم ميجانا طلب الطعام أو الدفع مباشرة من طاولاتهم باستخدام هواتفهم. وقد وفر هذا الحل للعملاء تجربة ذاتية مريحة، وساهم في تخفيف الضغط على الموظفين القليلين المتاحين في المطعم.",
        },
        {
          text: "نظام إدارة مطاعم (RMS) ",
          highlight: false,
          description: "بواجهة مستخدم سهلة، تطبيق نادل صديق للمستخدم، وخدمة إدارة الطاولات. ساعدت هذه الأدوات فريق ميجانا في إدارة الطلبات وتقديم الخدمة للعملاء بشكل أكثر كفاءة.",
        },
      ],
    },
  },
 {
    type: "normalRow",
    props: {
        title: "خدمة QR تُحدث نقلة نوعية في تجربة عملاء ميجانا",
        text: "كانت النتائج ملحوظة. فقد تم إجراء ما يقرب من نصف (48٪) المدفوعات باستخدام QR، الذي وجده العملاء مريحًا للغاية. وقد أدى هذا التحسين إلى زيادة رضا العملاء، وتحسين كفاءة العمليات، وتسريع الخدمة، مما أسهم في توفير تجربة طعام أكثر متعة."
    }
 }
];

export default strory5;
