import { Row } from "@/src/types/interfaces";

const strory6: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "الحفاظ على الفخامة و تحقيق الكفاءة التشغيلية",
      text: "واجه ترنكيلو، الذي يوفر تجربة طعام راقية، تحديات في ارتفاع النفقات التشغيلية وعدم كفاءة العمليات، مما أثر على جودة الخدمة. كانوا بحاجة إلى حل فعّال من حيث التكلفة يتيح لهم تبسيط العمليات اليومية دون التضحية بالطابع الفاخر لعلامتهم التجارية.",
    },
  },
  {
    type: "normalRow",
    props: {
      title: "حلول فعّالة لخفض التكاليف في المطاعم الراقية",
      text: "قدمت أمرك نظام إدارة مطاعم بسيط مصمم خصيصاً لعمليات ترنكيلو اليومية، مع التركيز على سهولة الاستخدام والتكامل السلس. كما تم تزويد فريق العمل بتطبيق النادل سهل الاستخدام لتحسين سير الخدمة من حيث استلام الطلبات واغلاق الفواتير بسرعة فائقة، وتمت إضافة خدمة إدارة الطاولات لتسريع دوران الطاولات، مما ساعد الفريق على إدارة ترتيبات الجلوس والحجوزات بكفاءة.",
    },
  },
  {
    type: "normalRow",
    props: {
      title: " تحقيق الاستقرار والنمو مع حلول أمـركـ",
      text: "بفضل حلول أمرك، نجح ترنكيلو في تقليل التكاليف التشغيلية بشكل ملحوظ، مما انعكس إيجاباً على النفقات التشغيلية. وقد أسهم النظام المطور في تحسين كفاءة الخدمة، مما مكّن الفريق من التركيز على تقديم تجربة فاخرة تلبي توقعات العملاء. نتيجةً لذلك، تعمل ترنكيلو الآن بتحكم واستقرار أكبر، مما يتيح لهم مواصلة تعزيز علامتهم التجارية دون زيادة النفقات.",
    },
  },
];

export default strory6;
