import { Row } from "@/src/types/interfaces";

const strory7: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "كيف تغلب ركن ليلك على ارتفاع التكاليف التشغيلية",
      text: "ركن ليلك، منشأة فاخرة في قلب الرياض، كانت تواجه تحديات تتعلق بارتفاع التكاليف التشغيلية والتأخير في تقديم الخدمات خلال ساعات الذروة. كانوا بحاجة إلى حل يتيح لهم التحكم في النفقات التشغيلية وتسريع عملية الدفع للحفاظ على سمعتهم الراقية والاستجابة للطلب المتزايد.",
    },
  },
  {
    type: "normalRow",
    props: {
      title: "تسهيل إدارة الطاولات و تسريع عملية الدفع في ركن ليلك",
      text: "قدمت أمرك نظام إدارة مطاعم مبسّط يتناسب مع احتياجات ركن ليلك الفريدة. بالإضافة إلى تطبيق النادل سهل الاستخدام وإدارة الطاولات الفعّالة، تم تقديم تقنية الدفع على الطاولة QR  التي تتيح للزبائن طلب ودفع الفواتير بأنفسهم، مما ساعد في تسريع عملية الدفع وتقليل الضغط على الموظفين خلال الفترات المزدحمة.",
    },
  },
  {
    type: "normalRow",
    props: {
      title: "ركن ليلك يُحقق وفورات كبيرة مع نظام أمـركـ منخفض التكلفة",
      text: "من خلال تطبيق نظام أمرك منخفض التكلفة، تمكن ركن ليلك من تحقيق تخفيضات كبيرة في النفقات التشغيلية، مما أدى إلى تحسين التحكم في التكاليف دون التأثير على جودة الخدمة. وقد أدى تعزيز العمليات إلى تحسين رضا العملاء، حيث يتمتع الزبائن بوقت انتظار أقصر وتجربة أكثر سلاسة. يعمل ركن ليلك الآن بكفاءة عالية، مما يعزز من مكانته كأحد أفضل الوجهات في الرياض",
    },
  },
 
];

export default strory7;
