import { Row } from "@/src/types/interfaces";

const strory8: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "تحسين الكفاءة التشغيلية وتجربة العملاء",
      text: "واجه مطعم كوچِه، المعروف بتقديمه للمأكولات الفارسية الفاخرة، بعض التحديات التشغيلية التي تواجه عادةً المطاعم الراقية. تمثلت هذه التحديات في إدارة المخزون بكفاءة، والتحكم في التكاليف، وتوحيد المصروفات، وإدارة طلبات التموين، مما أثر على قدرتهم في الحفاظ على جودة الخدمة مع التحكم في النفقات.",
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "كفاءة تشغيلية غير مسبوقة مع حلول أمـركـ",
      content: [
        {
          text: "إدارة مخزون متقدمة:",
          highlight: false,
          description: " قدمت أمرك نظامًا متطورًا لإدارة المخزون، مما سمح لكوچِه بإدارة المكونات بفعالية، وتقليل الهدر، ومراقبة مستويات المخزون بشكل لحظي.",
        },
        {
          text: "إدارة طلبات التموين:",
          highlight: false,
          description: "قدمت أمرك أداة مبسطة لإدارة طلبات التموين، مما ساعد كوچِه على التعامل بكفاءة مع طلبات التموين الكبيرة وضمان جودة الخدمة.",
        },
      ],
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "كوچِه يحقق النجاح المنشود",
      content: [
        {
          text: "تحكم أفضل في المخزون:",
          highlight: false,
          description: "بفضل البيانات اللحظية، استطاع كوچِه من التحكم بشكل أفضل في المخزون، مما قلل من النقص ومنع التكدس الزائد.",
        },
        {
          text: "تحسين مراقبة التكاليف:",
          highlight: false,
          description: "ساعدت أدوات أمرك لإدارة المخزون كوچِه في مراقبة تكاليف المكونات والمصروفات العامة بدقة، مما ساهم في تبسيط العمليات وزيادة الربحية.",
        },
        {
          text: "إدارة سلسة للتموين:",
          highlight: false,
          description: "سهلت قدرات إدارة التموين من أمرك عملية إدارة الطلبات، مما مكّن كوچِه من تقديم خدمة استثنائية عند التعامل مع أحجام الطلبات الكبيرة بسهولة.",
        },
      ],
      quoteAfter: "ساعدت حلول أمرك كوچِه في تحسين عملياتها، مما أتاح التحكم الدقيقة على المخزون، وإدارة التكاليف بشكل فعال، وتحسين عمليات التموين. بفضل هذه الأدوات، يمكن لكوچِه الآن التركيز على تقديم تجربة طعام فاخرة مع الحفاظ على الكفاءة التشغيلية والفعالية في إدارة التكاليف.",
    },
  },
];

export default strory8;
