import { Row } from "@/src/types/interfaces";

const strory9: Row[] = [
  {
    type: "normalRow",
    props: {
      title: "التغلب على تحديات الخدمة السريعة في أوقات الذروة",
      text: "احتاج مطعم نكهة بلدي، وهو مطعم شعبي في المدينة المنورة، إلى طريقة مبتكرة لمواكبة متطلبات الخدمة السريعة خاصة في أوقات الذروة. تمثلت التحديات الرئيسية في إدارة العروض الترويجية وتبليغها للعملاء بكفاءة، بالإضافة إلى تنسيق الطلبات بين أقسام المطبخ.",
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "حلول أمـركـ تُساهم في نجاح مطعم نكهة بلدي",
      content: [
        {
          text: "نظام كاشير مبسط:",
          highlight: false,
          description: "مكّن نظام الكاشير السهل الاستخدام من أمرك فريق نكهة بلدي من تسريع عملية استقبال الطلبات وتبسيط خدمة العملاء.",
        },
        {
          text: "إدارة العروض عبر نقاط البيع:",
          highlight: false,
          description: "باستخدام أدوات إدارة العروض المدمجة في نظام الكاشير من أمرك، تمكن فريق العمل من تبليغ العملاء بالعروض الترويجية بسهولة، مما ضمن خدمة سريعة وواضحة.",
        },
        {
            text: "تنظيم الطلبات بين الأقسام:",
            highlight: false,
            description: "مكّن حل أمرك من تنسيق الطلبات بسلاسة بين أقسام المطعم المختلفة، مما ساعد الفريق على إدارة الطلبات بدقة وكفاءة.",
          },
      ],
    },
  },
  {
    type: "rowDottedHighlited",
    props: {
      title: "",
      content: [
        {
          text: "تسريع معالجة الطلبات:",
          highlight: false,
          description: "ساهم نظام الكاشير السهل في تسريع عملية استقبال الطلبات، مما أتاح لفريق نكهة بلدي خدمة عدد أكبر من العملاء في وقت أقل.",
        },
        {
          text: "تبسيط إدارة العروض:",
          highlight: false,
          description: "أصبح بإمكان فريق العمل تبليغ العملاء بالعروض الترويجية بسهولة وسرعة، مما أسهم في تحسين تجربة العملاء وجعلها أكثر فاعلية.",
        },
        {
          text: "تحسين تدفق العمليات:",
          highlight: false,
          description: "ساعدت مطبوعات الطلبات المُنسقة بين الأقسام على تعزيز كفاءة المطبخ ومساعدة الفريق بأكمله على العمل بتناغم، مما أدى إلى تحسين التدفق العام للخدمة، وتسريع تسليم الطلبات.",
        },
      ],
    },
  },
];

export default strory9;
