[
  {
    "id": 1,
    "heading": "إدارة المطاعم من أمرك : الطريق إلى التميز والكفاءة في عالم المطاعم",
    "paragraph": "تعرف على أفضل استراتيجيات إدارة المطاعم مع أمرك. حلول مبتكرة تشمل التخطيط الاستراتيجي، توظيف وتدريب الموظفين، التكنولوجيا الحديثة، إدارة المخزون، والتسويق الرقمي لتحقيق النجاح وزيادة الأرباح.",
    "searchKey": "restaurant-management",
    "briefTitle": "إدارة المطاعم من أمرك"
  },
  {
    "id": 2,
    "heading": "نظام نقاط البيع(POS) وأهميته في الأعمال التجارية",
    "paragraph": "تعرف على أهمية نظام نقاط البيع (POS) لتحسين كفاءة الأعمال التجارية.  اكتشف المزايا، المكونات، وطريقة العمل لتحقيق نمو مستدام وزيادة رضا العملاء",
    "searchKey": "pos-systems-importance",
    "briefTitle": "نظام نقاط البيع(POS)"
  },
  {
    "id": 3,
    "heading": "برنامج للمطاعم: تعزيز الكفاءة وتحسين تجربة العملاء",
    "paragraph": "تعرف على أهمية برنامج المطاعم في تعزيز الكفاءة وتحسين تجربة العملاء. اكتشف مكوناته الرئيسية وفوائده في تحسين العمليات وزيادة الربحية.",
    "searchKey": "restaurant-management-system",
    "briefTitle": "برنامج للمطاعم"
  },
  {
    "id": 4,
    "heading": "نظام نقاط البيع للمطاعم: تحسين الأداء وزيادة الكفاءة",
    "paragraph": "تعرف على أهمية نظام نقاط البيع (POS) للمطاعم في تحسين الأداء وزيادة الكفاءة. اكتشف مكوناته وفوائده وكيفية اختياره وتنفيذه بنجاح في مطعمك.",
    "searchKey": "pos-systems-impact",
    "briefTitle": "نظام نقاط البيع للمطاعم"
  },
  {
    "id": 5,
    "heading": "نظام الولاء للمطاعم: مفتاح النجاح في عالم التنافس",
    "paragraph": "تعرف على كيفية إنشاء نظام ولاء فعال لمطعمك لجذب العملاء وزيادة الربحية. اكتشف الأنواع المختلفة لنظام الولاء وأفضل الممارسات لتحفيز العملاء وتعزيز النجاح.",
    "searchKey": "loyalety-programs",
    "briefTitle": ""
  },
  {
    "id": 6,
    "heading": "أمرك برنامج جاهز للمطاعم",
    "paragraph": "تعرف على برنامج أمرك لإدارة المطاعم وكيفية تحسين الكفاءة التشغيلية وزيادة الربحية. استمتع بحلول متكاملة لتسهيل إدارة الطلبات والمخزون وتحليل الأداء.",
    "searchKey": "amrk-ready-to-use",
    "briefTitle": "أمرك برنامج جاهز للمطاعم"
  },
  {
    "id": 7,
    "heading": "كيف تدير مطعم ناجح؟",
    "paragraph": "تعرف على خطوات إدارة مطعم ناجح من خلال التخطيط الاستراتيجي، اختيار الموقع المثالي، بناء فريق عمل محترف، وتقديم خدمة عملاء مميزة لضمان النجاح والتميز في سوق المطاعم.",
    "searchKey": "how-to-manage-restaurant",
    "briefTitle": "كيف تدير مطعم ناجح؟"
  }
]
