[
  {
      "id": 1,
      "heading": "كيف قلل عصير الضاحية التكاليف التشغيلية بنسبة 5٪",
      "paragraph": "علامة تجارية معروفة في مجال بيع العصائر بالتجزئة في منطقة الخليج، تمتلك أكثر من 45 فرعًا وتخدم عملاءها منذ عام 1978. منذ بداياتها، نمت لتصبح رمزًا وطنيًا، تقدم خدمات التجزئة، التموين، والتوصيل. لكن إدارة العمليات بسلاسة عبر الفروع باستخدام انظمة قديمة ومعقدة أصبحت مكلفة وغير فعّالة.",
      "content": "",
      "searchKey": "dahia"
  },
  {
      "id": 2,
      "heading": " كيف أطلقت مطابيق إمكانيات جديدة مع أمـركـ",
      "paragraph": "مطابيق، مطعم شهير لتقديم المطبق في شمال الرياض، معروف بمذاق معجناته اللذيذة على الصاج وخدمة طلبات الأون لاين السريعة. مع نمو قاعدة العملاء وتزايد التنافس المحلي، كانت مطابيق بحاجة إلى حل حديث لتحسين عملياتها وزيادة مبيعات طلبات الأون لاين. تعرّف على كيفية مساهمة نظام نقاط البيع وطلبات طلبات الأون لاين من أمرك في زيادة الإيرادات وتبسيط العمليات وتحسين تجربة العملاء.",
      "content": "",
      "searchKey": "matabeeq"
  },
  {
      "id": 3,
      "heading": "كيف حسّنت زوايا لاونج عملياتها باستخدام أمـركـ",
      "paragraph": "زوايا لاونج، المعروفة بالأجواء الهادئة والخدمة المميزة، كانت تواجه تحديات في إدارة الطلبات ومعالجة الفواتير خلال أوقات الذروة. أدت الطرق التقليدية إلى وقوع أخطاء وبطء الخدمة، مما أثر على رضا العملاء. كان هناك حاجة لحل شامل يسهم في تبسيط العمليات وتحسين تجربة العملاء.",
      "content": "",
      "searchKey": "zwaya"
  },
  {
      "id": 4,
      "heading": "تحسين سرعة الخدمة وتدفق العملاء مع حلول أمـركـ",
      "paragraph": "تسببت شهرة النقطة الساخنة في تحديات عدة، لا سيما في إدارة العدد الكبير من العملاء خلال ساعات الذروة. كانت الطوابير الطويلة وأوقات الانتظار تؤثر على رضا العملاء، مما جعل من الصعب الحفاظ على تجربة سريعة وفعالة تلبي توقعات العملاء.",
      "content": "",
      "searchKey": "hot-broest"
  },
  {
      "id": 5,
      "heading": "كيف ساعدت أمرك على حل مشكلة تكاليف الموظفين",
      "paragraph": "واجه مطعم مجبانا، المطعم المتوسطي المحبوب في برلينغتون بكندا، تحديًا شائعًا بين العديد من المطاعم في كندا: تكاليف التوظيف المرتفعة. ومع قلة عدد الموظفين المتاحين، كان هناك بطء في الخدمة أثر على رضا العملاء. تعرف على كيف ساعدت أمرك في تحسين العمليات دون التضحية بجودة الخدمة.",
      "content": "",
      "searchKey": "mayjjana"
  },
  {
      "id": 6,
      "heading": "تعزيز الكفاءة التشغيلية وتقليل التكاليف",
      "paragraph": "واجه ترانكويلو الذي يوفر تجربة طعام راقية، تحديات في ارتفاع النفقات التشغيلية وعدم كفاءة العمليات مما أثر على جودة الخدمة. كانوا بحاجة إلى حل فعال من حيث التكلفة يساعدهم في تبسيط العمليات اليومية دون التضحية بالطابع الفاخر لعلامتهم التجارية.",
      "content": "",
      "searchKey": "tranquillo"
  },
  {
      "id": 7,
      "heading": "عمليات سلسة لتجربة كافيه فاخرة",
      "paragraph": "ركن بيلك، منشأة فاخرة في قلب الرياض، كانت تواجه تحديات تتعلق بارتفاع التكاليف التشغيلية والتأخر في تقديم الخدمات خلال ساعات الذروة. كانوا بحاجة إلى حل يتيح لهم التحكم في النفقات التشغيلية وتسريع عملية الدفع للحفاظ على سمعتهم الراقية والاستجابة للطلب المتزايد.",
      "content": "",
      "searchKey": "lailac"
  },
  {
      "id": 8,
      "heading": "تمكين كوجه من إدارة المخزون بأسلوب مبتكر",
      "paragraph": "واجه مطعم كوجه المعروف بتقديمه المأكولات الفارسية الفاخرة، بعض التحديات التشغيلية التي تواجه عادة المطاعم المرموقة. كان من المهم تحسين إدارة المخزون بكفاءة والتحكم في التكاليف، وتوحيد المصروفات، وإدارة طلبات التوريد، مما أثر على قدرتهم في الحفاظ على جودة الأطعمة مع التحكم في النفقات.",
      "content": "",
      "searchKey": "koojeh"
  },
  {
      "id": 9,
      "heading": "تسريع الخدمة وتحسين العمليات بمساعدة أمـركـ",
      "paragraph": "احتاج مطعم نكهة بلدي، وهو مطعم شعبي في المدينة المنورة، إلى طريقة مبتكرة لمواكبة متطلبات الخدمة السريعة خاصة في أوقات الذروة. تمثلت التحديات الرئيسية في إدارة العروض الترويجية وتلبية الطلبات بكفاءة، بالإضافة إلى تنسيق الطلبات بين أقسام المطبخ.",
      "content": "",
      "searchKey": "nakhat-baldi"
  },
  {
      "id": 10,
      "heading": "تسريع الخدمة مع نظام نقاط البيع من أمـركـ",
      "paragraph": "واجه متجر نونا آيسكريم، وهو متجر شعبي للآيس كريم السريع، تحديًا في مواكبة الطلب المرتفع من العملاء خلال ساعات الذروة، مع الحفاظ على سرعة وكفاءة الخدمة. حيث أثرت الطوابير الطويلة وبطء معالجة الطلبات على رضا العملاء وحدت من قدرتهم على خدمة المزيد من الضيوف في أوقات الذروة.",
      "content": "",
      "searchKey": "nuna-icecream"
  }
]
